Importing libraries and loading data

In [54]:
import pandas as pd
import numpy as np

data = pd.read_csv("ai_job_dataset1.csv")

Dropping rows that don't have useful data

In [55]:
data = data.drop(['job_id'], axis=1)
data = data.drop(['posting_date'], axis=1)
data = data.drop(['application_deadline'], axis=1)
data = data.drop(['job_description_length'], axis=1)

Checking for empty rows

In [56]:
data.isna().sum()
#Since there are no empty columns, there is no need to fix

job_title             0
salary_usd            0
salary_currency       0
salary_local          0
experience_level      0
employment_type       0
company_location      0
company_size          0
employee_residence    0
remote_ratio          0
required_skills       0
education_required    0
years_experience      0
industry              0
benefits_score        0
company_name          0
dtype: int64

Looking for incorrect data types

In [57]:
print(data.dtypes)
#It seems that all the data types are already correct and in pandas the object type is the correct data type for text/string columns

job_title              object
salary_usd              int64
salary_currency        object
salary_local            int64
experience_level       object
employment_type        object
company_location       object
company_size           object
employee_residence     object
remote_ratio            int64
required_skills        object
education_required     object
years_experience        int64
industry               object
benefits_score        float64
company_name           object
dtype: object

Checking for duplicates

In [58]:
data.duplicated().sum()
#No duplicates

np.int64(0)

Lookign for outliers

In [59]:
data.describe()
#Taken into account what this dataset is about, there is no possible outliers honestly

,salary_usd,salary_local,remote_ratio,years_experience,benefits_score
count,15000.000000,1.500000e+04,15000.000000,15000.000000,15000.000000
mean,121991.938267,8.292366e+05,50.196667,6.365667,7.499540
std,63968.361846,3.425325e+06,40.844084,5.598551,1.444202
min,16621.000000,1.662100e+04,0.000000,0.000000,5.000000
25%,74978.500000,7.383075e+04,0.000000,2.000000,6.300000
50%,107261.500000,1.090355e+05,50.000000,5.000000,7.500000
75%,155752.250000,1.673278e+05,100.000000,10.000000,8.800000
max,410273.000000,3.368541e+07,100.000000,19.000000,10.000000

Checking common rules

In [60]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15000 entries, 0 to 14999
Data columns (total 16 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   job_title           15000 non-null  object
 1   salary_usd          15000 non-null  int64
 2   salary_currency     15000 non-null  object
 3   salary_local        15000 non-null  int64
 4   experience_level    15000 non-null  object
 5   employment_type     15000 non-null  object
 6   company_location    15000 non-null  object
 7   company_size        15000 non-null  object
 8   employee_residence  15000 non-null  object
 9   remote_ratio        15000 non-null  int64
 10  required_skills     15000 non-null  object
 11  education_required  15000 non-null  object
 12  years_experience    15000 non-null  int64
 13  industry            15000 non-null  object
 14  benefits_score      15000 non-null  float64
 15  company_name        15000 non-null  object
dtypes: float64(1), int64(4), object(11)
memory usage: 1.8+ MB

In [61]:
data[data['salary_usd'] <= 0]
data[data['salary_local'] <= 0]
data[data['remote_ratio'] < 0]
data[data['years_experience'] < 0]
#No rules broken

Empty DataFrame
Columns: [job_title, salary_usd, salary_currency, salary_local, experience_level, employment_type, company_location, company_size, employee_residence, remote_ratio, required_skills, education_required, years_experience, industry, benefits_score, company_name]
Index: []

The dataset is already clean, so there was nothing to change